# تقسيم المواد المعدل بالظبط
SUBJECTS_DATA = {
    "علمي": {
        "🕌 المواد الشرعية": ["فقه", "توحيد", "حديث", "تفسير"],
        "📖 المواد العربية": ["نحو", "صرف", "بلاغة", "أدب ونصوص"],
        "🔬 المواد العلمية والثقافية": ["كيمياء", "فيزياء", "تاريخ", "رياضيات", "إنجليزي"]
    },
    "أدبي": {
        "🕌 المواد الشرعية": ["فقه", "توحيد", "حديث", "تفسير", "منطق"],
        "📖 المواد العربية": ["نحو", "صرف", "بلاغة", "أدب ونصوص", "مطالعة", "عروض وقافية"],
        "📚 المواد الثقافية والأدبية": ["تاريخ", "جغرافيا", "فلسفة", "إنجليزي", "فرنساوي"]
    }
}
